export class GlobalConstants {
  public static nameCinema: string = "Ronin Visual";
  public static topMenu: string = "topMenu";
  public static navBarMenu: string = "navBarMenu";
  public static soonFilms: object = [
    {
      name: 'Rennin One',
      data: new Date(2020, 12, 15),
      id: 1,
      img: 'https://lh3.googleusercontent.com/proxy/RsNvU5MzKDDzixeTHt6OH_NLsc6Xm0W0aAzTjyQSC6lGpnilBueiapqTjrblZOnUwmamIqEMJDHsndzXKhSiGey2o98oOTVkLUPyFEn9LLpLdDwIZM3ah_1GWubQlgct10_t7XqmUWd16Ublqa8l8Uo'
    },
    {
      name: 'Rennin Two',
      data: new Date(2020, 8, 8),
      id: 2,
      img: 'https://i.pinimg.com/originals/be/93/b3/be93b399540cc2220b6179db30476a3d.jpg'
    },
    {
      name: 'Rennin Three',
      data: new Date(2020, 1, 10),
      id: 3,
      img: 'https://www.kinogallery.com/img/wallpaper/kinogallery-wallpaper-0436179001480929899-1920x1080.jpg'
    },
    {
      name: 'Rennin Four',
      data: new Date(2020, 7, 7),
      id: 4,
      img: 'https://img1.goodfon.ru/wallpaper/nbig/a/22/akame-ga-kill-ubiyca-akame-3179.jpg'
    },
    {
      name: 'Rennin Five',
      data: new Date(2020, 11, 6),
      id: 5,
      img: 'https://i.pinimg.com/originals/4f/2d/2b/4f2d2b0bdaac806ad8c9b4fc435e64f2.jpg'
    }];
  public static shares: object = [
    {
      name: 'Ретроспектива від Ronin', start: new Date(2020, 5, 8), end: new Date(2020, 7, 1),
      info: 'Зовсім скоро на нас чекають прем\'єрні покази та нові стрічки на великому екрані. А поки пропонуємо вам згадати фільми, що вже стали класикою світового кінематографу у нашій новій рубриці «Ретроспектива від Multiplex».\n' +
        'Кожної пятниці у цій добірці з\'являтимуться стрічки, що виходили у цей день в різні роки в минулому. Так, це свого роду «Машина часу від кінематографу» – подорожуйте нею разом з нами!'
    },
    {
      name: 'Я люблю кіно 3000\n', start: new Date(2020, 7, 9), end: new Date(2020, 8, 11),
      info: '\n' +
        'Спеціально до річниці виходу в прокат фільму з кіновсесвіту Марвел «Месники: Завершення», ми підготували подарунок' +
        ' для справжніх кіноманів. Ми випустили 3000 super-квитків на ваші улюбені місця SuperLux (ті самі диванчики у кінці залу),' +
        ' а також у зали з технологіями IMAX, IMAX Laser та ScreenX. Так, ви давно їх просили - тож ми їх створили!' +
        ' Схопи свій super-квиток можна та придбай сертифікат на два або чотири квитки відповідно'
    },
    {
      name: 'КУПУЙ ЗАРАЗ - КІНУЙ ПІЗНІШЕ!', start: new Date(2020, 3, 31), end: new Date(2020, 12, 13),
      info: '\n' +
        'Карантин обов’язково закінчиться, а кіношечка - ніколи!Набридло сидіти вдома, передивлятися старі фільми та серіали? ' +
        'Немає змоги поділитися своїми враженнями з друзями?Це все негативно впливає на твій настрій, а відтак і на імунітет.' +
        'Вигідно інвестуй у майбутнє! Купи зараз сертифікат за найнижчою ціною та скористайся ним протягом 6 місяців після карантину.' +
        'Таким чином ти допоможеш улюбленому кінотеатру та інвестуєш у свій настрій та імунітет!Кошти, отримані від продажу сертифікатів,' +
        ' будуть направлені на забезпечення заробітної плати персоналу кінотеатрів. Купуючи сертифікат, ви даєте можливість зберегти робочі місця співробітників Multiplex.'
    },
    {
      name: 'Оренда кінозалу\n', start: new Date(2019, 1, 9), end: new Date(2023, 8, 11),
      info: 'Твій івент у Multiplex! Мережа кінотеатрів Multiplex пропонує оренду залів з професійним обладнанням та великим екраном.' +
        ' З нами ви можете провести велику конференцію, презентацію, засідання своєї компанії  чи приватний показ у 17 містах' +
        ' України. Навіть одночасно! Бо у Multiplex є можливість організувати телемости.'
    },
    {
      name: 'Персональні 3D-окуляри!', start: new Date(2017, 12, 9), end: new Date(2023, 8, 11),
      info: 'З 2-го грудня 2019-го року всі кінотеатри Multiplex повністю переходять на персональні окуляри для сеансів в технології 3D*. ' +
        ' Купуючи один раз власні - Ви зможете використовувати їх постійно. Просто, зручно, гігієнічно, без подряпин.'
    }]
}


